content-org/all-posts.zh-cn.org
#+hugo_base_dir: ../

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+options: author:nil

** DONE 炒饭周摘 2023-04-09
CLOSED: [2023-04-16 Sun 15:03]
:PROPERTIES:
:EXPORT_FILE_NAME: weekly-summary-2023-04-09.zh-cn.md
:EXPORT_DATE: <2023-04-16 Sun>
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :featuredImage /ox-hugo/weekly-summary-2023-04-09-cover.jpeg
:END:
#+hugo_tags: 周摘
从这周开始，我想记录一下每周读了什么文章或书，看了什么东西，做了什么事情。
#+hugo: more
[[https://chaoruan.xyz/posts/weekly-summary-2023-04-09][English Version]]
*** 读了什么
**** [[https://sspai.com/post/79262][Warp：是时候改变你的命令行工具了]]
很早就接触了Warp,但是竟然需要注册才能使用，直接劝退。
**** [[https://jason-memo.dev/posts/my-mac-setting/][我的提升生產力 Mac 設定與軟體]]
写的不错，有些工具我竟然没听过，我肯定会尝试一下
- NightOwl
- brew bundle
- GNU Stow
**** [[https://www.gcores.com/articles/164692][任天堂公布多种《塞尔达传说：王国之泪》周边]]
被种草了心之容器和大师剑的灯
*** 看了什么
**** [[https://www.youtube.com/watch?v=guKBgnzhijE][《薩爾達傳說 王國之淚》第3部介紹影片（香港）]]
实在是等不及，度日如年！
**** [[https://www.imdb.com/title/tt5791038/?ref_=ttep_ep1]["Succession" Celebration (TV Episode 2018)]]
开始看好评如潮的 Succession, 第一集有点慢热但很有意思，应该会继续追下去。
*** 做了什么
**** [[https://www.keychron.com/pages/keychron-q2-customizable-mechanical-keyboard][Keychron Q2 Customizable Mechanical Keyboard]]
升级了吃饭的家伙，入手后好喜欢，打字的每个瞬间都像是在按摩！

